app/controllers/items_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '1') LIMIT 1
SELECT * FROM `items` WHERE (`items`.`id` = 1102818 AND (`items`.user_id = 2))
---
  def index
    debugger
    user =User.find(params[:user_id])
    @items = user.items.find(:all)

SELECT * FROM `items` WHERE (`items`.`id` = 1)
---
  def edit
    @item = Item.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`id` = '3') LIMIT 1
INSERT INTO `items` (`sale_status`, `item_list`, `created_at`, `photo_file_size`, `item_choice`, `updated_at`, `photo_file_name`, `photo_content_type`, `item_name`, `item_description`, `user_id`, `photo_updated_at`, `picture`) VALUES('', '', '2011-12-16 19:37:27', 568010, 0, '2011-12-16 19:37:27', 'Screen shot 2011-12-15 at 5.22.12 PM.png', 'image/png', '', '', 1, '2011-12-16 19:37:27', NULL)
---
  def create
    @item = Item.new(params[:item])
    @item.user=User.find (params[:user_id])
    respond_to do |format|
      if @item.save

SELECT * FROM `items` WHERE (`items`.`id` = 1)
UPDATE `items` SET `item_name` = 'Tshirt 2', `updated_at` = '2011-12-20 06:02:00', `item_list` = '', `sale_status` = '', `item_choice` = 0 WHERE `id` = 15
---
  def update
    @item = Item.find(params[:id])
    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT * FROM `items` WHERE (`items`.`id` = 2)
DELETE FROM `items` WHERE `id` = 2
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy