app/controllers/offers_controller.rb

SELECT * FROM `items` WHERE (`items`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`id` = '3') LIMIT 1
SELECT * FROM `offers` WHERE (`offers`.user_id = 3)
---
  def index
      item = Item.find(params[:item_id])
      user=User.find(current_user.id)
#      user = User.find(params[:current_user_id])
      @offers = item.offers.find(:all)

SELECT * FROM `offers` WHERE (`offers`.`id` = 2)
---
  def show
    @offer = Offer.find(params[:id])

SELECT * FROM `offers` WHERE (`offers`.`id` = 51)
---
  def edit
    @offer = Offer.find(params[:id])

SELECT * FROM `items` WHERE (`items`.`id` = 1)
INSERT INTO `offers` (`My_item_id`, `created_at`, `updated_at`, `user_id`, `my_user_id`, `item_id`, `offer_status`) VALUES(NULL, '2011-12-17 13:36:02', '2011-12-17 13:36:02', NULL, NULL, 4, NULL)
---
  def create
    debugger
    #offers=Offer.find_by_sql(["select * from offers where user_id= ? and offer_status= ?",current_user.id,0])
    #if offers.offer_status[0] ==nil
        @offer = Offer.new(params[:offer])
        @offer.item=Item.find(params[:item][:item_id])
        temp_public_user_id=Item.find_by_sql(["select user_id from items where id= ? ",params[:item][:item_id]])
        @offer.public_user_id=temp_public_user_id[0].user_id
       #@offer.user=User.find(params[:user_id])
        @offer.my_item_id= params[:item][:my_item_id]
        @offer.user_id= current_user.id
       #user= Item.find(params[:item_id])
            @offer.offer_status=1
            respond_to do |format|
            if @offer.save