app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = '--- :user_name\n' AND (id = 1))
SELECT * FROM `items` WHERE (user_id = 1) AND (`items`.`user_id` = '--- :all\n') LIMIT 1
SELECT * FROM `offers` WHERE (public_user_id = 1)
SELECT * FROM `items` WHERE (`items`.`id` = 7) LIMIT 1
---
  def index
     #item = Item.find(params[:id])
    #@comments = item.comments.find(:all)
    #@comment=Item.find(params[:item_id])

    @comments=Comment.find(:all)
    @shares=Share.find(:all)
    @users= User.find(:all)
    @user_list=User.find_by_sql(["select * from users where id<>?",current_user])
    @offerCount=Offer.find_by_sql(["select * from offers where public_user_id=? and offer_respond=?",current_user.id,"offered"]).count
    @itemsCount=Item.findItemCount(current_user)
    @my_current_offers = Offer.find_by_sql(["select * from offers where public_user_id = ? and offer_respond=?",current_user.id,"offered"])
    @sendOffers=Offer.find_by_sql(["select * from offers where user_id=? and offer_respond=?",current_user.id,"offered"])
    @user=User.find(current_user.id)
    @offers=Offer.findrecent().paginate(:per_page=>3,:page=>params[:page])
    user =User.find(current_user)
    @items_list = user.items.find(:all)
<<<<<<< HEAD
    #@user_offer = Offer.find(:all).paginate(:per_page=>2,:page=>params[:page])
    #@items=Item.itempage(params[:page])
    #@user_item = Item.itempage(params[:page])
    @user_item = Item.find(:all).paginate(:per_page=>3,:page=>params[:page])

INSERT INTO `users` (`created_at`, `photo_file_size`, `crypted_password`, `updated_at`, `photo_file_name`, `photo_content_type`, `password_salt`, `photo_updated_at`, `user_name`, `persistence_token`, `email`) VALUES('2011-12-18 06:27:07', NULL, '1edeea15ee561c5136b026b246788d072c4ec100c327c08dbddfe65facdf774e6f5b8453c20374465033956be0a13d7d571c89772368b304bb45c03cb95fa674', '2011-12-18 06:27:07', NULL, NULL, 'xz1XCqeU75KBkoVslZ', NULL, 'amit', 'cd4f384ab6fd146f33529193409eca56b090dc536c931ac8800b8e12977316987059daf084d10808935ecafddbc3e8d26172512c92faf28b51531edcb4b60f07', 'adm@gmail.com')
---
  def create
    #@comment.item=Item.find(params[:item_id])
    @user = User.new(params[:user])
    if @user.save

UPDATE `users` SET `updated_at` = '2011-12-16 13:27:04', `crypted_password` = '5c83bb4a4cf23a76399aed7e1c0e7f5494cf56dacd40f096054a248cc542ba01ad7ca4dd120666b4e04941c49319abd57119617369469a9c7a0d894a393b242a', `password_salt` = 'HfHprzp3p1eUubTSevE', `persistence_token` = 'f4f9db1d359c7f604675658366390ab53405d01185ba931fb6433cb713af9ec75649261880f4ab0b3fcaf3ba0d6083b8dbb81d2eca4bc02caafed255990f3f36' WHERE `id` = 3
---
  def update
    @user = current_user
    if @user.update_attributes(params[:user])